{
	"releases": [
		{"version": "3.1", "date": "2017-01-01", "notes": "- Created a new `Mail` wrapper class around SwiftMailer for better email handling than CodeIgniter's built-in email class. Thanks to forum user TheDrew for helping us sort through some of these issues.\n\n## Nova Core\n- Updated the controllers with the new Mail class calls.\n- We've removed all the reply-to calls with emails since more and more spam filters are checking the reply-to headers as well as the from header.\n- Added a notice to the bottom of all emails that it's an automated email and they shouldn't reply to the message.\n- Updated the manifest Javascript to remove hard-coded calls to a table structure. This has become problematic as people have begun to modify the manifest to have less traditional layouts.\n- Updated the error language file with a new error message.\n\n## Fixed Issues\n- When there is no manifest metadata, an extra space is displayed.\n- Fixed issue where users could view pending and saved mission posts, personal logs, and news items from their respective view pages."},
		{"version": "3.0.2", "date": "2016-12-25", "notes": "## Nova Core\n- Updated the Nova database to allow for mission posts, personal logs, and news items of more than 65,000 characters.\n- Updated the behavior of replying to a private message from your own sent messages. Previously, it would reply to yourself, but now will reply to the original recipient. (Thanks to Williams for this update!)\n- Updated how Nova handles incrementing the version number in hopes of mitigating the \"0.0.0\" database version issue.\n"},
		{"version": "3.0.1", "date": "2016-12-25", "notes": "## Nova Core\n- Updated the Nova database to allow for mission posts, personal logs, and news items of more than 65,000 characters.\n- Updated the behavior of replying to a private message from your own sent messages. Previously, it would reply to yourself, but now will reply to the original recipient. (Thanks to Williams for this update!)\n- Updated how Nova handles incrementing the version number in hopes of mitigating the \"0.0.0\" database version issue.\n"},
		{"version": "3.0", "date": "2016-12-20", "notes": "## Nova Core\n- We've updated the gender identification selections on new installations to be more in line with social conventions. Hermaphrodite has been replaced with Transgendered/Intersex and Neuter has been replaced with Agendered/Non-Binary.\n## Fixed Issues\n- We've made some changes to the email class in the hopes of reducing the number of errors people are starting to see.\n- Addressed an error with assigning departments to a manifest."}
	]
}
